import { type Color } from '@/components/Sidebar/types';

export default function () {
  const categories = [
    'Бутсы (1000)',
    'Кеды (10 000)',
    'Кроссовки (30 000)',
    'Слипоны (2 000)',
    'Сникеры (100)',
    'Чешки (10)',
    'Шиповки (50)',
  ];

  const brands = [
    'Nike (1 103)',
    'Tendance (549)',
    'GEOX (441)',
    'adidas (428)',
    'ECCO (195)',
    'Zara (140)',
    'Mascotte (135)',
  ];

  const sellers = [
    'Wildberries (4 532)',
    'Rendez-Vous (913)',
    'JUST WOW! (198)',
    'ECCO (195)',
    'КАРИ ООО (160)',
    'Mascotte (136)',
    'KEDDO (34)',
  ];

  const sizes = [
    '9 (11)',
    '22,5 (42)',
    '23 (57)',
    '23,5 (55)',
    '24 (89)',
    '24,5 (123)',
    '25 (243)',
    '25,5 (249)',
    '26 (359)',
    '26,5 (369)',
    '27 (349)',
    '27,5 (298)',
    '28 (312)',
    '28,5 (203)',
    '29 (169)',
    '29,5 (37)',
    '30 (122)',
    '30,5 (30)',
    '31 (106)',
    '31,5 (14)',
    '32 (120)',
    '33 (125)',
    '34 (320)',
    '34,5 (201)',
    '35 (875)',
    '35,5 (352)',
    '36 (2 148)',
    '36,5 (289)',
    '37 (2 051)',
    '37,5 (398)',
    '38 (2 872)',
    '38,5 (161)',
    '39 (7 945)',
    '39,5 (767)',
    '40 (17 871)',
    '40,5 (787)',
    '41 (21 335)',
    '41,5 (639)',
    '42 (20 535)',
    '42,5 (800)',
    '43 (20 357)',
    '43,5 (1 116)',
    '44 (21 034)',
    '44,5 (784)',
    '45 (12 504)',
    '45,5 (114)',
    '46 (3 408)',
    '46,5 (220)',
    '47 (762)',
    '47,5 (49)',
    '48 (477)',
    '48,5 (29)',
    '49 (277)',
    '50 (144)',
    'без размера (354)',
  ];

  const discounts = [
    'от 10% и выше',
    'от 30% и выше',
    'от 50% и выше',
    'от 70% и выше',
  ];

  const deliveryTimes = ['1 день', '2 дня', 'до 3 дней', 'до 5 дней'];

  const colors: { color: Color; title: string }[] = [
    { color: 'beige', title: 'бежевый (1000)' },
    { color: 'white', title: 'белый (1000)' },
    { color: 'blue', title: 'голубой (1000)' },
    { color: 'yellow', title: 'жёлтый (1000)' },
    { color: 'green', title: 'зелёный (1000)' },
    { color: 'brown', title: 'коричневый (1000)' },
    { color: 'red', title: 'красный (1000)' },
    { color: 'orange', title: 'оранжевый (1000)' },
    { color: 'pink', title: 'розовый (1000)' },
    { color: 'gray', title: 'серый (1000)' },
    { color: 'darkblue', title: 'синий (1000)' },
    { color: 'purple', title: 'фиолетовый (1000)' },
    { color: 'black', title: 'чёрный (1000)' },
  ];

  return {
    categories,
    brands,
    sellers,
    sizes,
    deliveryTimes,
    discounts,
    colors,
  };
}
